[
  {
    "text": "On September 1, 2020, Sacher Hotels will start a unique cooperation with BMW: Enjoy a stay at Hotel Sacher Wien or Salzburg – and add the ultimate driving pleasure in a BMW luxury car. A unique experience for motor enthusiasts and luxury lovers!\nTwo hotels, four wheels, unlimited pleasure: The BMW in which you will be travelling to Salzburg or Vienna is waiting for you in front of Hotel Sacher Wien/Salzburg (you choose the starting point!) – but first things first – not before you’ve enjoyed a slice of Original Sacher-Torte. En route, you and your companion give your dream car a test drive until you park that luxury car in front of the luxury hotel… Here, whether at Hotel Sacher in Salzburg or Vienna, we will spoil you with an upgrade to a junior suite, a delicious three-course evening meal and an opulent breakfast on the following morning. Of course, your BMW is also at your disposal for the return journey. Have a safe trip!\nSACHER MEETS BMW Challenge!\nA very special treat awaits all sports car enthusiasts who book this package: Take part in our SACHER MEETS BMW Challenge during your journey for a chance to win a place on the Sports Driver Training course at the next “BMW M Trackday”.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-meets-bmw/"
    }
  },
  {
    "text": "Luxury Living in Mozart's Birthplace\nThe Amadeus of 5-Star Accommodations\nHear the music and experience the history of Mozart’s hometown. At Hotel Sacher Salzburg, history and luxury are two sides of one imperial coin. Live like royalty and feel like family in the company of world-class musicians, statespeople, business leaders, artists, and celebrities. Visit Mozart’s birthplace, Hohensalzburg Fortress, or the Salzburg Festival. Experience excellence, comfort, hospitality, and culture in the heart of Salzburg.\nWelcome \nLUXURY ON EVERY LEVEL\nROOMS AND SUITES\nPremium Culinary Experiences\nCuisine of the Highest Caliber\nHotel Sacher Salzburg’s world-class restaurant transforms enjoyment into high art. Experience dining of the finest order, whatever your tastes.\nSERVUS SALZBURG\nWELCOME TO Salzburg LUXURY\nA stay at the Hotel Sacher Salzburg is sure to raise anyone’s experience of Salzburg to unforgettable heights.\nAngelique Weinberger\nHotel Manager \nSacher Sets the Scene\nElevate Any Event\nFrom business conferences to fairy-tale weddings, Hotel Sacher Salzburg offers a host of spaces and settings that provide an unforgettable backdrop for your guests.\nSALZBURG\nHEALTH CLUB\nDiscover What Our Guests Are Saying on TripAdvisor!\n.TA_selfserveprop > #CDSWIDSSP { width: 100% !important; max-width: 100% !important; }",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/"
    }
  },
  {
    "text": "Rooms & Suites\nLeider konnten keine Ergebnisse gefunden werden, die den ausgewählten Filtern entsprechen \nShow more \nA GREAT CHOICE OF ROOMS AND SUITES\nThe Hotel Sacher Salzburg has a total of 110 uniquely designed and comfortably furnished rooms and suites. Some rooms have a balcony with a wonderful view of Salzburg’s old town and Hohensalzburg Fortress. The spacious hotel rooms and suites range from 25 to 150 square meters. All rooms offer our guests different bed sizes, such as King size or single beds to choose from. Adjoining rooms can be booked on request.\nThe Sacher signature extends across all our room categories, ensuring the highest sense of well-being and luxury no matter the selection. \nSovereign feeling of wellbeing\nDeluxe Rooms & Junior Suites\nEnjoy luxurious living comfort in an elegant atmosphere and relax in a stylish ambience in the heart of the city.\nExtravagant living comfort\nSignature & Presidential Suites\nReside imperially in a stylish and elegant ambience in the heart of Salzburg and make your stay at the Hotel Sacher an unforgettable experience.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/rooms/"
    }
  },
  {
    "text": "Attractions\nBest Sights to See in Salzburg\nSALZBURG IS CALLING YOU \nTHE SITES AND SOUNDS OF SALZBURG - AN OVERVIEW\nEVENTS AND TIPS\nEVENTS, SPECIAL ACTIVITIES AND CULTURAL HIGHLIGHTS",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/servus-salzburg/sights/"
    }
  },
  {
    "text": "HIGH-CLASS COMFORT\nSuites with view or balcony\nThese luxurious and spacious Signature Suites overlook the Salzach River, the Salzburg Theater, or Makart Square. They offer a luxurious 40 to 57 square meters (431 to 614 square feet) in the One Bedroom Suites and 90 square meters (969 square feet) in the Two Bedroom Suites of living space. Each suite is uniquely decorated and furnished with valuable oil paintings and antiques. The suites have bright marble bathrooms and toilets.\nFree\nNon-alcoholic minibar\nJoin a select circle of visitors from across the ages who have made these suites their home. \nMODERN AMENITIES, CLASSIC STYLE\nThe One & Two Bedroom Suites offer high class features and combine tradition with modern luxury. Members of state, royalty, and celebrities\nhave made these suites their home away from home for more than 100 years. We have what it takes to satisfy even the most demanding guests.\nLeider konnten keine Ergebnisse gefunden werden, die den ausgewählten Filtern entsprechen \nShow more \nEAT AND DRINK IN STYLE\nTHE FINEST CULINARY EXPERIENCES",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/signature-suite-salzburg/"
    }
  },
  {
    "text": "THE ULTIMATE IN LAVISH LIVING\nDELUXE ROOMS\nOur Deluxe rooms offer all the quality and amenities you would expect from a 5-star luxury hotel spread opulently across 24 to 35 square meters (258 to 377 square feet). All rooms are tastefully adorned with valuable works of art and antiques. The colorful marble bathrooms underscore every room's elegance and splendor.\nFree\nNon-alcoholic minibar\nUnique touches and lavish luxury across the board.\nTHE HEIGHT OF COMFORT AND BEAUTY\nInviting seating and stylish furniture offer high-class comfort and set the stage for an unforgettable stay at the Hotel Sacher Salzburg.\nColorfully tiled and welcoming bathrooms give life at the hotel a luxurious sparkle.\nLeider konnten keine Ergebnisse gefunden werden, die den ausgewählten Filtern entsprechen \nShow more \nEAT AND DRINK IN STYLE\nTHE FINEST CULINARY EXPERIENCES",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/deluxe-room-salzburg/"
    }
  },
  {
    "text": "SECOND TO NONE\nJUNIOR SUITE\nSpaciousness, comfortable seating areas, fantastic views, and marble bathrooms with heated floors are a few of the features that set apart our popular Junior Suites. The suites are between 35 and 45 square meters (377 to 430 square feet) in size. The interiors are bright, beautiful, and elegant. All suites offer fantastic views of the Salzach River or the Salzburg Theater. The marble bathrooms offer a separate shower and bathtub.\nFree\nNon-alcoholic minibar\nBroadening the meaning of luxury and well-being.\nMODERN COMFORT AND TIMELESS CLASS\nThe Junior Suites are among the hotel’s most popular. The heart of the Junior Suites is the large combined living room and bedroom.\nThe large glass window between the bathroom and living room is one of this category’s most striking features.\nLeider konnten keine Ergebnisse gefunden werden, die den ausgewählten Filtern entsprechen \nShow more \nEAT AND DRINK IN STYLE\nTHE FINEST CULINARY EXPERIENCES",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/junior-suite-salzburg/"
    }
  },
  {
    "text": "Sacher Specials\nSacher Convenience Stay Salzburg\nSacher Convenience Stay\nEmbrace the timeless beauty of the season with our Winter Convenience Stay at the Hotel Sacher in Vienna. Take things at your own pace with our flexible check-in and check-out times, allowing you to seamlessly tailor your stay to fit your schedule. Indulge in the Sacher’s historic luxury while enjoying the convenience of flexible timings, ensuring your visit is as effortless as it is unforgettable.\nDETAILS\n• Flexible check-in and check-out from 6 a.m. to 10 p.m., subject to availability and prior arrangement (up to 24 hours before arrival).\n• Available for the travel period from January 7 to March 30, 2025.\n• Bookable until November 30, 2024.\nSacher Convenience Stay\nBook your Wintertime Convenience Stay today and discover the true meaning of relaxation and convenience.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/sacher-convenience-stay/"
    }
  },
  {
    "text": "Presidential Suite\nPRESIDENTIAL SUITE\nTOP TIER LUXURY\nThe most luxurious way to stay in our hotel. Our Presidential Suites offer impressive views of Salzburg or the State Theater, and measure approximately 150 square meters. This includes a beautiful, large bedroom and an elegant parlor. The suites are equipped with a bathroom and a separate washroom.\nThe most memorable way to savour Salzburg.\nOne of a Kind\nReds, greens, and taupes are these suites’ defining colors, from the window trimmings to the furniture and decor. A large living area and a separate bedroom are just some of the luxurious amenities.\nImpressive works of art, valuable carpets, and floors of the finest wood complete the elegant look. Every suite has is unique and appreciated on its own merits by our guests.\nEAT AND DRINK IN STYLE\nTHE FINEST CULINARY EXPERIENCES",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/presidential-suite/"
    }
  },
  {
    "text": "Luxury and Grace\nSacher Suites \nDiscover Enchanting Salzburg\nThe dreamlike scenery of Salzburg's old town and the Salzach river complements the sophisticated ambience of our suites, which ensure extensive well-being thanks to their carefully selected interior design and luxurious comfort. A stroll through Salzburg's old town, just a few minutes away from our Hotel Sacher Salzburg, rounds off your experience in one of Austria's most beautiful cities. Be our guest and let us enchant you.\nWhen booking this package, you can choose between our Signature Suites or our Presidential Suites.\nSignature Suites\nDuring your stay in one of our Signature Suites, you can look forward to:\n» Breakfast in the Salzach Room at Hotel Sacher Salzburg \n» Chilled sparkling champagne in your room\n» Sightseeing experiences of your choice\n» A sweet surprise\n» Our exclusive minibar\n» Complimentary airport or train station transfer\n» 24/7 concierge service from the moment of your booking\nAvailable for booking from 2 nights per person. You can cancel your stay for free until 12.00 p.m. on the day of arrival.\nPresidential Suites\nDuring your stay in one of our Presidential Suites, you can look forward to:\n» Breakfast in the Marble Hall at Hotel Sacher\n» Chilled sparkling champagne in your room\n» Sightseeing experiences of your choice\n» Complimentary airport or train station transfer\n» 24/7 concierge service from the moment of your booking\n» A sweet surprise\n» Luggage packing service and dedicated ASP\n» Private in-room check-in for utmost discretion\n» Transfers within the city area\n» Flexible check-in and check-out\n» Private bar with a selection of spirits\nSacher Specials\nDiscover more exclusive Sacher Salzburg specials:",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/sacher-suites/"
    }
  },
  {
    "text": "Sacher comfort at the highest level also for dogs: Even the legendary grande dame of the house, Anna Sacher, loved four-legged friends in her environment. We continue this tradition and are happy to have dogs as welcome guests at the Hotel Sacher Salzburg.\nDog blankets, towels, food bowls and of course a comfortable dog basket are available in the rooms. A special “do not disturb” sign for your animal companion ensures an undisturbed stay. Leashes in various sizes and “Gassi-Sackl” are available at the reception. We can also organize dog sitters upon request.\nPrice\nEUR 42,- per day",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/sacher-pets/"
    }
  },
  {
    "text": "Sacher Suites Special Offer\nSacher Suites Salzburg\nSacher Suites\nWhat makes your stay in Salzburg special? One of our unique suites, of course! Enjoy exclusive luxury and let us spoil you in the evening in a selected Séparée or the Sacher Grill with a first-class 5-course dinner including a matching wine accompaniment. We will enchant you with special moments of delight in Salzburg!\nDETAILS\n• Sparkling Breakfast in your suite\n• Bottle of champagne in your room on arrival\n• 5-course dinner incl. wine accompaniment\n• Sweet surprise\n• We will pick you up in town, from the airport or the train station and bring you back on departure\n• Bookable from 2 nights\n• Free cancellation until 12 noon on the day of arrival\nSacher Suites\nGet your Sacher Suites special offer now:",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/sacher-suites3/"
    }
  },
  {
    "text": "Kid-Friendly Hotel in Salzburg\nPetit Sacher\nExcellence for Sacher Guests of All Sizes\nProud parents of the youngest Hotel Sacher guests: we are big into pampering your little ones just as we pamper you. Our Petit Sacher package provides your child with no small pleasure, including a welcome gift (surprise!) and the My Hotel Sacher booklet to guide your child around the hotel.\nYou will also find a Petit Sacher menu in all our restaurants to keep tots’ and toddlers’ tummies full and put smiles on even the tiniest of faces.\nOther Goodies for Your Little Sacher Guest\nSuper soft and snuggly child’s bathrobe\nChildren’s slippers that are so soft, they slip themselves on\nBath set for tear-free tub time\nKids’ turndown service, complete with bedtime treat\nKid-friendly DVD set chock full of family entertainment\nBoard games for all ages\nCot or extra bed with children’s bed linen\nBabysitting service on request\nAsk your concierge for bottle warmers, diaper buckets, high chairs, bibs, children’s dishes, laundry service, baby phones or anything else your little ones desire.\nBig Benefits for Little Guests\nOne more thing to know for our little guests at the Hotel Sacher Salzburg: the Health Club team has created treatments that are specifically aligned to the needs of children and teenagers. See the Health Club Folder for details.\nCONCIERGE SERVICE\nWe make the impossible possible",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/petit-sacher/"
    }
  },
  {
    "text": "Sacher Family\nExplore Salzburg with Teddy Franz\nSacher Family\nSpend unforgettable days with your family in Salzburg. With the Salzburg Card you can discover the most beautiful sights of the city, from the Fortress Hohensalzburg to the Trick Fountains at Hellbrunn - fun and excitement are guaranteed for young and old alike.\nFROM 2 NIGHTS\n• Breakfast included\n• 50% discount on the second room (up to 3 children, up to and including 16 years)\n• Salzburg Card 48h per person\n• Sweet surprise\nSacher Family\nMake sure to get our Sacher Family special offer:",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/sacher-family/"
    }
  },
  {
    "text": "Restaurants & Cafés in Salzburg\nA SENSE OF THE EXTRAORDINARY\nThe Sacher signature proudly stretches across the entire culinary experience. Enjoy carefully crafted confections, culinary variety of unforgettable quality, and drinks in stylish surroundings. Delve into the finest offering of uniquely Austrian cuisine, coffeehouse culture, and hospitality.\nWe aim to serve the best flavors and ingredients our region has to offer with every meal and to every diner.\nMichael Gahleitner\nChef de Cuisine \nA TOUCH OF SACHER\nSacher Bar\nWhether in the early evening or late at night, at the Sacher Bar you will find a special blend of sophistication, elegance and style in an impressive ambience.\nComplete your stay by indulging in our culinary highlights. \nAUSTRIAN COFFEEHOUSE CULTURE\nCafé Sacher\nA visit to Café Sacher is a must for every visitor to the city. Enjoy a piece of the famous Original Sacher-Torte or traditional Austrian dishes accompanied by our wide selection of coffees, teas and wines.\nRoom Service\nBreakfast menu is available daily from 7 am to 11 am.\nDay menu is available daily from 11 am to 10 pm\nNight menu is available daily from 10 pm to 7 am",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/restaurants/"
    }
  },
  {
    "text": "You can count on Head Concierge Simon Mlinar and his team to deliver the Salzburg experience of your dreams. They are masters of forging inside connections within Salzburg’s top attractions.\nEvery day, they scout out elite experiences throughout the city so they can cater to your tastes and interests, with the utmost discretion and friendliness.\nTheir raison d’être: to show you Salzburg at its most sublime and most unforgettable. We look forward to showing you the best of our beloved city!\nHotel Sacher Salzburg\nSchwarzstraße 5-7, 5020 Salzburg\nTel.: +43 (0) 662 889770",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/servus-salzburg/concierge/"
    }
  },
  {
    "text": "Luxury Wellness Experience\nThe Ultimate Wellness Experience\nFITNESS AND RELAXATION\nRELAXATION AND FITNESS IN A UNIQUE ATMOSPHERE\nTreat yourself to relaxation at our Health Club and unwind with a tantalizing array of options. Enjoy a well-deserved break with a massage or book a session with a personal trainer. For detailed information about our relaxing offers, please contact our Spa team.\nOpening Times\nPlease note: Our Sacher Health Club is open for hotel guests upon request from Monday until Sunday.\nLet our team take you on a journey of relaxation that will complete your stay with us as only a Sacher Spa treatment could.\nAngelique Weinberger\nHotel Manager \nMassage\nLie back and forget everyday life for a moment during a sumptuous massage.\nSteam Bath & Sauna\nBalance mind and body the Nordic way and unwind in Sacher’s beautiful sauna and steam bath facilities.\nFitness Center\nTreat your body right and stay fit during your stay at Hotel Sacher Salzburg with state-of-the-art fitness equipment, available whenever you want it.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/health-club/"
    }
  },
  {
    "text": "Hotel Sacher Concierge\nServus Service in Salzburg\nYOUR WELL-BEING IS OUR GREATEST AMBITION\nWe make your stay in Salzburg a unique experience.\nOur team of experienced concierges strive to achieve the impossible for you. They are proud to be your personal Salzburg insider and to provide you with access to the best the city has to offer at all times.\nLet us unlock Salzburg’s treasures for you!\nHotel Sacher Salzburg\nAddress: Schwarzstraße 5-7, 5020 Salzburg\nTel.: +43 (0) 662 889 770\nFax.: +43 (0) 662 889 779 02299\nEmail: salzburg@sacher.com\nOur Concierge Service\nMAKES DREAMS COME TRUE\nEvents and Tips\nEVENTS AND ACTIVITIES IN SALZBURG\nExperience something extraordinary in Salzburg, any day of the week! Here is our collection of sights you will not want to miss in Salzburg! This will help you get more out of your stay in Mozart’s birth city.\nThe Salzburg Festivals bring an uncomparable flair to the city and something that is not to be missed!\nTop Attractions\nDISCOVER THE BEST SALZBURG HAS TO OFFER\nTable for two at Salzburg’s most popular restaurant? Done! Tickets to an exclusive cultural event? Our pleasure! A spur-of-the-moment guided tour? Your wish is our command!\nTreat Yourself to Experiencing Salzburg at its Most Exquisite.\nOur talented team of concierges take pride in leaving no guest’s wish unfulfilled.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/servus-salzburg/"
    }
  },
  {
    "text": "Meetings & Events\nBusiness and Private Events\nSingular Settings for One-of-a-Kind Events\nFrom business meetings and company workshops to corporate conferences, Hotel Sacher Salzburg offers premium tailored packages for all your business and private event needs in a unique setting. No amenity is lacking and every service is at your disposal, from catering and conference options to technical support and equipment.\nContact us\nreservierung.salzburg@sacher.com\nMouth-Watering Catering\nExceptional Culinary Experiences\nNo matter what your dining needs are, the Hotel Sacher Salzburg team will ensure an excellent and delectable catering experience, from menu creation to cuisine, service, and decoration.\nEquipped for Everything\nTop technology is at hand to make sure that your event runs smoothly. Be it screens and projectors or high-res displays that you require, our team can tackle any technical scenario.\nSeating\nHotel Sacher Salzburg is able to accommodate all your needs within a wide variety of settings, from banquet scenarios, canapées, and cocktails to flying dinners and round-table affairs.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/events/meetings-events/"
    }
  },
  {
    "text": "Let yourself be enchanted\nSalzburg\nChristmas & New Year's Eve\nSpend the reflective Christmas season at Hotel Sacher Salzburg and let yourself be enchanted by the magical atmosphere in Salzburg. Enjoy the wintry season with your loved ones while staying in our luxurious rooms and suites, and relax with soothing beauty treatments in our spa. Round off your trip with a slice of Original Sacher-Torte in our Café Sacher Salzburg and delicious menus in our exclusive restaurant Sacher Grill. Get in the mood for the Christmas season with our selection of exclusive gift tips and traditional Salzburg Christmas markets.\nCulinary Highlights\nChristmas\nImmerse yourself in the culinary world of Sacher and enjoy the Christmas holidays with the specially prepared menus of our chef Michael Gahleitner.\nIn addition to the menus, we offer à la carte dishes in our Sacher Grill on Christmas Eve and Christmas Day.\nWe look forward to welcoming you to our restaurants!\nPlease dress in accordance with the occasion.\nCulinary Highlights\nNew Year's Eve\nCelebrate the New Year in an atmospheric ambience in restaurants Zirbelzimmer and Sacher Grill with delicious menu creations of our chef Michael Gahleitner.\nWe look forward to an unforgettable start into 2024 with you!\nPlease dress in accordance with the occasion.\nExclusive Package\nAnna Sacher Breakfast\nStart off unforgettable Christmas holidays with your loved ones and get in the mood for Christmas Eve with an exclusive “Anna Sacher Frühstück” in our Café Sacher Salzburg at the 24th of December 2024. In addition, a Christmas surprise awaits you at breakfast.\nLet our team enchant you and indulge into the magical world of coffee house culture.\nWe look forward to your visit!\nYour stay at the Sacher Salzburg\nDream Holiday in Winter\nThe winter months invite you to dream in Salzburg’s city centre. Discover the famous Getreidegasse and Salzburg’s Christmas markets during an enchanting walk or an unforgettable Fiaker ride. End the day with a hot chocolate in our Café Sacher Salzburg or the festively decorated lobby, and indulge your palate with delicious menus in our Sacher Grill restaurant.\nSacher to give away\nGift tips\nEvent Tips\nChristmas Markets in Salzburg\nExperience Salzburg’s Advent from up close and let the fairytale Christmas markets cast their spell on you. Whether on the magnificent Domplatz and Residenzplatz, in front of the baroque Mirabell Palace or at the idyllic Wolfgangsee, the atmospheric settings delight with Christmas flair – from traditional, romantic to modern charm.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/events/christmas-newyearseve-salzburg/"
    }
  },
  {
    "text": "Wintergarten Meeting Room\nWintergarten\nMake Meetings Memorable\nThe hotel’s conservatory on the river banks offers fantastic views of the spires of the Old Town, making it a one-of-a-kind location for a variety of events. Let us assist you in transforming this versatile venue into the ideal space for your personal, familial or professional needs. We offer a number of packages for your unique meetings, conferences and other functions.\nHotel Sacher Salzburg\nYour Home for Weddings",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/events/wintergarten/"
    }
  },
  {
    "text": "Unique Experiences\nSacher Specials\nWith a cherry on the top!\nAlmost as good as the Original Sacher-Torte itself – when you book a room or a suite, Sacher is currently offering a complimentary unique experience as ‘icing on the cake’! There’s a special to suit every taste – from a city adventure with Teddy Franz for the kids to an exquisite cultural experience selected by the concierge to a one-of-a-kind Hotel Sacher Tour, which takes you on an exciting journey through time...\nEach unique Sacher special additionally comes with breakfast included as well as a sweet surprise. And because security and flexibility are more important than ever, there is the option of canceling until 12 p.m. on the day of arrival!\nHave you already booked?\nEVENTS & VENUES\nMAKE SACHER’S MAGIC YOUR OWN",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/sacher-specials/"
    }
  },
  {
    "text": "LUXURY ABOVE THE CITY'S ROOFS\nSACHER SKY SUITE\nIn the Sacher Sky Suite, an entire city lies at your feet: From your private roof terrace and luxurious parlor, you enjoy a unique view over Salzburg’s Old Town, majestically framed by the local mountains and Hohensalzburg Fortress. Newly built on the roof of Hotel Sacher Salzburg, the Sky Suite is the largest self-contained suite in the city and impresses with its stylish luxury, tasteful interior and the very finest materials!\nOld Town and fortress\nView\nFree\nNon-alcoholic minibar\nDreaming permitted!\nAn exclusive roof construction, built just for you: The new Sacher Sky Suite ensures that you enjoy privacy in an elegant ambiance. Modern art meets the classics – timeless luxury is presented here in taupe, ivory and pale rose for a stylish and unobtrusive feel. French star designer Pierre-Yves Rochon was the lead designer. Two cozy tower rooms invite you to dream – in the Sacher Sky Suite, you are particularly close to the stars, after all!\nHealth Club Salzburg\nFitness and relaxation",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/sacher-sky-suite/"
    }
  },
  {
    "text": "Frequently Asked Question\nQuestions and Answers\nWe’ve compiled a list of frequently asked questions to assist you. Should you require further clarification, please don’t hesitate to contact our support team.\nThank you!\nQuestions and Answers\nWhat is the address of the hotel?\nSchwarzstraße 5-7, A-5020 Salzburg, Austria\nDoes the hotel offer an airport shuttle service?\nWe are pleased to offer you our transfer services from the airport or train station for a fee .To book your transfer please contact us under portier.salzburg@sacher.com\nCheck out time is until 12 pm.\nWhat time is breakfast served?\nDaily from 07:00 to 10:30\nWhat are the opening hours of the restaurants?\nWhat is the child policy?\nChildren up to 16 years stay without charge in the same room as their parents.\nAdditional beds are available from the Junior Suite upwards.\nWe provide a valet parking service for our valued guests.\nWhat are the opening hours of the health club?\nOur Sacher Health Club is open for hotel guests upon request from Monday until Sunday.\nDoes the hotel have a swimming pool?\nUnfortunately, we don’t have a swimming pool on site.\nDoes the hotel offer WIFI?\nWiFi is available in all areas and is free of charge.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/faqs-sacher-salzburg/"
    }
  },
  {
    "text": "Salzachzimmer Event Venue\nSalzachzimmer\nMODERN AMBIENCE FOR YOUR GUESTS\nThe Salzachzimmer offers an incredible view on the eponymous river and also creates a vivid ambience for diverse events. The newly designed room with its bright decor and natural light forms a fresh frame for private, as well as occupational celebrations. Additionally, we are pleased to support you with our newest technical equipment to give your presentations or conferences the perfect polish.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/events/salzachzimmer/"
    }
  },
  {
    "text": "Sacher Weddings\nWeddings at Hotel Sacher Salzburg\nA Sumptuous Setting for Your Wedding\nGetting ready for that most romantic of days? Hotel Sacher Salzburg will arrange your nuptials down to the finest detail in a setting of unforgettable opulence. Our stunning classic interiors combine with premium contemporary amenities to make your wedding a most memorable experience. From taking your vows and receiving guests to the big celebration and even your wedding night accomodations, the Sacher will support you at every step – including delectable catering.\nA Splendid Array of Accomodations\nHotel Sacher Salzburg’s facilities are the perfect setting for your entire wedding, from start to finish and from champagne welcome to dazzling furnishings and delicious confections. Greet your friends and family, indulge in sumptuous refreshments, say “I do,” and give your wedding photographer the most beautiful backdrop imaginable in a historic, yet modern ambience.\nDream Wedding Cakes, the Sacher Way\nHotel Sacher Salzburg is proud to offer delightful confections and exceptional wedding cakes for the happy couple and their guests to enjoy\n– the world famous Original Sacher-Torte certainly makes for a special and memorable wedding cake.\nHOTEL SACHER SALZBURG\nYour Home for Weddings\nHotel Sacher Salzburg handles your every wedding need, from incomparably elegant rooms and interiors to the finest food, the most gorgeous flowers, and utterly dazzling decoration services. Make the Sacher Salzburg the home for your most beautiful day!",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/events/weddings/"
    }
  },
  {
    "text": "Hotel Sacher\nSalzburg\nSalzburg \nBook Now \nThings to do\nEvents & Highlights in Salzburg\nUpcoming Events\nThe best events in Salzburg\nConcierge-Service\nWe make dreams come true\nLearn more \nCall us\nContact us\nDirections",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/servus-salzburg/events-highlights/"
    }
  },
  {
    "text": "TRADITION NEU DEFINIERT\nDELUXE JUNIOR SUITE\nGeräumigkeit, bequeme Sitzgruppen, fantastische Ausblicke und Marmorbäder mit beheizten Böden sind nur einige der Merkmale, die unsere Deluxe Junior Suiten auszeichnen. Die Suiten sind zwischen 40 bis 50 Quadratmetern groß mit hellen und elegant gestalteten Innenräumen. Alle Suiten bieten einen fantastischen Blick auf die Salzach oder das Salzburger Landestheater. Die Marmorbäder verfügen über eine separate Dusche und Badewanne.\nKostenlos\nAlkoholfreie Minibar\nCast your eyes on the gorgeous city from your very own regal residence. \nZIMMER MIT AUSBLICK\nDie Deluxe Junior Suiten im Hotel Sacher Salzburg sind mit wunderschönen Möbeln und technologischen Annehmlichkeiten ausgestattet und verbinden\nTraditionsbewusstsein mit modernem Luxus. Staats- und Königsfamilienangehörige haben diese Suiten seit mehr als 100 Jahren zu ihrem Zuhause gemacht.\nMehr anzeigen \nEssen und TRINKEN mit STIL \nKulinarischer Genuss",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/deluxe-junior-suite/"
    }
  },
  {
    "text": "Meetings & Celebrations\nLUXURY AND CONVENIENCE\nIf you seek a luxurious, yet modern environment for your private or professional event, Hotel Sacher Salzburg’s “Wintergarten” offers a highly customizable, yet breathtakingly beautiful backdrop with state-of-the-art amenities. From multi-room-scenarios to a single stunning conservatory setting, we ensure events that meet only the highest standards and are happy to create customized experiences.\nContact\nChristmas & New Year´s Eve\nIf you are spending Christmas, New Year’s Eve or Day in Salzburg, you might come across some irresistible temptations. The kitchen team of the Hotel Sacher Salzburg treats their guests with outstanding culinary delights during the most joyful time of the year.\nBUSINESS & PRIVATE EVENTS\nFrom small networking gatherings and company workshops to full-blown corporate conferences, Hotel Sacher Salzburg offers premium tailored packages for all your business event needs within an impressive setting.\nWEDDINGS\nPreparing for that most beautiful of days? We endeavor to enchant you with a tailored wedding arrangement that exceeds your expectations. Our team will plan and organize your wedding with you from start to finish, from ceremony to reception, afterparty and brunch the next morning.. Our kitchen team will tantalize you with culinary delights of the highest order. Whatever your needs, Hotel Sacher Salzburg will make them happen, all in an opulent setting and with every unforgettable amenity.\nHotel Sacher Wintergarten\nBREATH-TAKING BANQUET SETTING\nSalzburg\nWintergarten\nThe hotel’s conservatory on the river banks offers fantastic views of the spires of the Old Town, making it a one-of-a-kind location for a variety of events.\nSalzburg\nSalzachzimmer\nThe Salzachzimmer offers an incredible view on the eponymous river and also creates a vivid ambience for diverse events. The newly designed room with its bright decor and natural light forms a fresh frame for private, as well as occupational celebrations.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/events/"
    }
  },
  {
    "text": "5-Star Deluxe Junior Suite\nTRADITION REDEFINED\nDELUXE JUNIOR SUITE\nExpansiveness and comfort combine with sweeping views, inviting furnishings, and bathrooms that will pamper even pedicured feet in our Deluxe Junior Suites, whose size ranges from 40 to 50 square meters (430 to 538 square feet). Tasteful interiors and cheery colors redefine elegance, while stunning views of the Salzach River or Salzburg Theater make every guest feel like royalty. Beautiful marble bathrooms come with a separate shower and bathtub.\nCast your eyes on the gorgeous city from your very own regal residence. \nROOMS WITH A VIEW\nThe Deluxe Junior Suites boast top-tier furnishing and technology and fuse a sense of tradition with modern luxuriousness.\nMembers of state, royalty, and celebrities have made these suites their home away from home for more than 100 years. We have what it takes to satisfy even the most demanding guests.",
    "metadata": {
      "url": "https://www.sacher.com/en/salzburg/room/deluxe-junior-suite-2/"
    }
  }
]